# NumberOfCriteria Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingPreferenceRule..::..NumberOfCriteria Property
RoutingPreferenceRule Class See Also
---
Gets the number of routing criteria.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int NumberOfCriteria { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfCriteria As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfCriteria {
	int get ();
}
```

# See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace